# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
#tap 'homebrew/dupes'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'trash'
brew 'wget'

# Development
brew 'postgresql'
brew 'kubectl'
brew 'terraform'
cask 'keybase'
cask 'gpg-suite'

# App Management
brew 'mas'

# Apps
cask 'alfred'
cask 'basecamp'
cask 'docker'
cask 'google-chrome'
cask 'opera'
cask 'macvim'
cask 'textmate'
cask 'visual-studio-code'
cask 'slack'
cask 'microsoft-teams'
cask 'pgadmin4'
cask 'textual'
cask 'tower'
cask 'jetbrains-toolbox'
cask 'kubernetic'
cask 'royal-tsx'
cask '1password'
cask 'mysqlworkbench'
cask 'pretzel'
cask 'vlc'
cask 'vmware-horizon-client'
cask 'bartender'
cask 'iterm2'
cask 'amazon-workspaces'
cask 'zoomus'
cask 'insomnia'
cask 'postman'
cask 'java'
cask 'istat-menus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store Items

mas "Airmail 3", id: 918858936
mas "Moom", id: 419330170