# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'node'
brew 'rbenv'
brew 'trash'
brew 'wget'

# Development
brew 'postgresql'

# Apps
cask 'alfred'
cask 'atom'
cask 'basecamp'
cask 'docker'
cask 'kitematic'
cask 'parallels-desktop'
cask 'goofy'
cask 'google-chrome'
cask 'opera'
cask 'hyperterm'
cask 'macvim'
cask 'textmate'
#cask 'android-studio'
cask 'intellij-idea'
cask 'phpstorm'
cask 'rubymine'
cask 'webstorm'
cask 'visual-studio-code'
cask 'slack'
cask 'pgadmin3'
cask 'textual'
cask 'tower'
cask 'sqlitebrowser'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
